## Insert

In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({"A":[2,0,6,8,5], "B":[1,4,3,7,9]})
var

   A  B
0  2  1
1  0  4
2  6  3
3  8  7
4  5  9

In [3]:
# insert(index no., position and name of a column to be inserted, data to be inserted)
var.insert(1, "C", var["A"])
var

   A  C  B
0  2  2  1
1  0  0  4
2  6  6  3
3  8  8  7
4  5  5  9

In [4]:
var.insert(1, "D", [3,8,0,9,4])
var

   A  D  C  B
0  2  3  2  1
1  0  8  0  4
2  6  0  6  3
3  8  9  8  7
4  5  4  5  9

In [5]:
var1 = pd.DataFrame({"A":[2,0,6,8,5], "B":[1,4,3,7,9]})
var1

   A  B
0  2  1
1  0  4
2  6  3
3  8  7
4  5  9

In [6]:
var1["C"] = var1["A"][0:3] # copy the elements from index 0 to 2 of column A in column C
var1

   A  B    C
0  2  1  2.0
1  0  4  0.0
2  6  3  6.0
3  8  7  NaN
4  5  9  NaN

## Delete

In [7]:
var2 = pd.DataFrame({"A":[2,0,6,8,5], "B":[1,4,3,7,9], "C":[6,0,3,2,5]})
print("Original Dataframe\n",var2,"\n")
d = var2.pop("B")
print(d,"\n")
print("DataFrame after deleting column B\n",var2)

Original Dataframe
    A  B  C
0  2  1  6
1  0  4  0
2  6  3  3
3  8  7  2
4  5  9  5

0    1
1    4
2    3
3    7
4    9
Name: B, dtype: int64

DataFrame after deleting column B
    A  C
0  2  6
1  0  0
2  6  3
3  8  2
4  5  5

In [8]:
del var2["A"]
var2

   C
0  6
1  0
2  3
3  2
4  5